-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.4.17-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.2.0.6213
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 unoestellar.actor 구조 내보내기
CREATE TABLE IF NOT EXISTS `actor` (
  `actorname` varchar(100) DEFAULT NULL,
  `m_index` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- 테이블 데이터 unoestellar.actor:~107 rows (대략적) 내보내기
DELETE FROM `actor`;
/*!40000 ALTER TABLE `actor` DISABLE KEYS */;
INSERT INTO `actor` (`actorname`, `m_index`) VALUES
	('신혜선', 1),
	('배종옥', 1),
	('허준호', 1),
	('톰 홀랜드', 2),
	('크리스 프랫', 2),
	('줄리아 루이스', 2),
	('유아인', 3),
	('박신혜', 3),
	('전배수', 3),
	('이현욱', 3),
	('이봉근', 4),
	('이유리', 4),
	('김하연', 4),
	('모아 감멜', 5),
	('메들린 마틴', 5),
	('강동원', 6),
	('이정현', 6),
	('이레', 6),
	('권해효', 6),
	('존 크래신스키', 7),
	('에밀리 블런트', 7),
	('대니 드비토', 7),
	('이안 맥켈런', 7),
	('존 데이비드 워싱턴', 8),
	('로버트 패틴슨', 8),
	('엘리자베스 데비키', 8),
	('제시카 차스테인', 9),
	('콜린 파렐', 9),
	('존 말코비치', 9),
	('유역비', 10),
	('이연걸', 10),
	('공리', 10),
	('견자단', 10),
	('김대명', 11),
	('송윤아', 11),
	('김의성', 11),
	('고아성', 12),
	('이솜', 12),
	('박혜수', 12),
	('조현철', 12),
	('이제훈', 13),
	('조우진', 13),
	('신혜선', 13),
	('김혜수', 14),
	('이정은', 14),
	('노정의', 14),
	('로자먼드 파이크', 15),
	('샘 라일리', 15),
	('아뉴린 바나드', 15),
	('한지민', 16),
	('남주혁', 16),
	('갤 가돗', 17),
	('크리스 파인', 17),
	('크리스틴 위그', 17),
	('페드로 파스칼', 17),
	('수잔 서렌든', 18),
	('케이스 윈슬렛', 18),
	('제이미 폭스', 19),
	('티나 페이', 19),
	('다비드 딕스', 19),
	('필리샤 라샤드', 19),
	('하나에 나츠키', 20),
	('키토 아카리', 20),
	('시모노 히로', 20),
	('마츠오카 요시즈쿠', 20),
	('히노 사토시', 20),
	('엄혜란', 21),
	('김시은', 21),
	('박지후', 21),
	('이다윗', 22),
	('조현', 22),
	('김도훈', 22),
	('설경구', 23),
	('변요한', 23),
	('이정은', 23),
	('민도희', 23),
	('다니엘 칼루야', 24),
	('키스 스탠필드', 24),
	('마틴 쉰', 24),
	('제시 플레먼스', 24),
	('강하늘', 25),
	('천우희', 25),
	('이설', 25),
	('이양희', 25),
	('빈 디젤', 26),
	('존 시나', 26),
	('성 강', 26),
	('샤를리즈 테론', 26),
	('미셸 로드리게즈', 26),
	('조다나 브류스터', 26),
	('엠마 스톤', 27),
	('엠마 톰슨', 27),
	('마크 스트롱', 27),
	('에밀리 비샴', 27),
	('폴 월터 하우저', 27),
	('제이슨 스타뎀', 28),
	('스콧 이스트우드', 28),
	('조휘 하트넷', 28),
	('포스트 말론', 28),
	('홀트 맥칼라니', 28),
	('베라 파미가', 29),
	('패트릭 윌슨', 29),
	('줄리안 힐리아드', 29),
	('로우리 오코너', 29),
	('등은희', 30),
	('이감', 30),
	('오국화', 30),
	('에밀리 블런트', 31),
	('킬리언 머피', 31),
	('밀리센트 시몬스', 31),
	('라이언 레이놀즈', 32),
	('사무엘 L.잭슨', 32),
	('셀마 헤이엑', 32);
/*!40000 ALTER TABLE `actor` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
