<!-- noticeboard, personalqna, basicqna -->




/*박현준 - 공지사항테이블. 번호, 구분(시스템, 영화관, 기타), 제목, 내용, 등록일, 조회수*/
create table noticeboard (
	noticeindex int auto_increment primary key,
	noticecate varchar(100),
	noticetitle varchar(100),
	noticecont varchar(3000),
	noticetime datetime,
	noticeview int
);

INSERT INTO unoestellar.noticeboard (noticecate,noticetitle,noticecont,noticetime,noticeview) VALUES
	 ('system','ㅊㅍ','ㅍㄹ','2021-05-21 10:48:43.0',1),
	 ('system','ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ','ㅁㄴㅇㄹ
ㄴㅇㄹ
','2021-05-21 11:03:24.0',10),
	 ('system','ㄹ','ㅇ','2021-05-21 11:13:31.0',3),
	 ('system','ㅁㄴㅇㄹ','1111','2021-05-21 11:13:50.0',7),
	 ('system','제목이다','11111111111
ㅇㅇㅇㅇㅇ
ㄹㄹㄹㄹ','2021-05-21 11:26:03.0',6),
	 ('system','공지다','ㅁ공지다임마
ㅎㅎ','2021-05-21 15:32:36.0',22),
	 ('system','홈페이지 점검시간','ㅁㅁㅁㅁㅁㅁ','2018-01-01 00:00:00.0',3),
	 ('movie','영화관 휴관일정','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ','2021-03-05 00:00:00.0',9),
	 ('etc','기타문의사항','ㄴㅇㅁㅇㄹ','2019-01-07 00:00:00.0',2),
	 ('movie','관 일정','ㅇㄹㅇㄴㄹㅇㄹㄴ','2016-04-01 00:00:00.0',2);
INSERT INTO unoestellar.noticeboard (noticecate,noticetitle,noticecont,noticetime,noticeview) VALUES
	 ('etc','번호는 108번이지롱','ㅁㄴㅇㄹ
번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
ㅍ
108번 글이다?
ㅍ
108번 글이다?
ㅍ
108번 글이다?
ㅍ
ㅁㄴㅇㄹ
ㅁㄴㅇㄹ
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?
108번 글이다?','2021-03-01 00:00:00.0',56),
	 ('system','112','ㅁㅁㅁㅁㅁㅁ','2018-01-01 00:00:00.0',5),
	 ('movie','113','113번째글임둥
113번째글임둥
113번째글임둥
113번째글임둥','2021-03-05 00:00:00.0',10),
	 ('etc','117번째글이다?','117번째글은
공지사항
이의
수정했다 ㅡㅡ','2019-01-07 00:00:00.0',9),
	 ('movie','118','11111111111
ㅇㅇㅇㅇㅇ
ㄹㄹㄹㄹㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇ','2016-04-01 00:00:00.0',5),
	 ('system','ㅁㄴㅇㄹ','ㄹㅇㄴㅁㅇ
ㅁㄴㅇㄹ
ㅁㄴㅇㄹ
','2021-05-24 14:41:26.0',9),
	 ('movie','ㄴㅇㄹ','ㅁ','2021-05-24 14:46:30.0',9),
	 ('movie','ㄱㄱㄱㄱㄱㄱㄱㄱㄱㄱㄱ','ㅂㅈㄷㄱ
ㅁㄴㅇㄹ
ㅋㅌㅊㅍ','2021-05-25 21:55:04.0',3),
	 ('system','123','123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
123
','2021-05-25 21:55:20.0',15),
	 ('system','124','ㅁㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴㄴ','2021-05-25 21:55:36.0',3);
INSERT INTO unoestellar.noticeboard (noticecate,noticetitle,noticecont,noticetime,noticeview) VALUES
	 ('system','125','55555555555555555555555555','2021-05-25 21:55:50.0',4),
	 ('system','ㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇ','수정했다ㄱㄱㄱ','2021-05-25 21:55:59.0',12),
	 ('system','127','수정했다ㄱㄱㄱ','2021-05-25 21:55:59.0',3),
	 ('system','ㅁㅁㅁ128','수정했다ㄱㄱㄱ','2021-05-25 21:55:59.0',8),
	 ('system','129번째당','수정했다ㄱㄱㄱ','2021-05-25 21:55:59.0',10),
	 ('system','ㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇ','수정했다ㄱㄱㄱ','2021-05-25 21:55:59.0',33);















/*박현준 - 1대1문의, 상담내역확인. 번호, 문의유형(일반문의, 영화정보, 회원, 예매, 분실물, 제안/건의), 아이디, 제목, 내용, 사진, 등록일, 답변칸, 답변시간, 답변상태*/
create table personalqna (
	persindex int auto_increment primary key,
	perscate varchar(100),
	persid varchar(100),
	perstitle varchar(100),
	perscont varchar(3000),
	persimg varchar(100),
	persqtime datetime,
	persacont varchar(3000),
	persatime datetime,
	persstate varchar(100)
);

INSERT INTO unoestellar.personalqna (perscate,persid,perstitle,perscont,persimg,persqtime,persacont,persatime,persstate) VALUES
	 ('movinfo','aaaa11','안녕','ㅁㅁㅁㅁㅁㅁ','','2021-05-25 22:03:32.0','다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
다음부턴 잘해줄게
','2021-05-25 22:03:32.0','답변완료'),
	 ('member','aaaa11','회원문의다이것들아','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ','1.png','2021-05-25 22:03:32.0','답변완료
답변완료
답변완료','2021-05-26 05:07:23.0','답변완료'),
	 ('member','bbbb22','ㅎㅇㅎㅇ','ㅁㄴㅇㄴㅇㄻㄹㅇ','','2021-05-25 22:03:32.0','미안해 bbbb11아..','2021-05-27 06:55:06.0','답변완료'),
	 ('basic','bbbb22','ㅁ1ㄴ2ㅇ3ㄹ4','ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
ㄴㅇㅁ질문ㄹ
','','2021-05-25 22:03:32.0','알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..알았어 미안해..
','2021-05-27 06:54:15.0','답변완료'),
	 ('suggest','aaaa11','제안합니다','ㅇㄹㅇㄴㄹㅇㄹㄴ','','2021-05-25 22:03:32.0','내가뭐르그르러멛개먿

내가 뭘그렇게

잘못했는데?

내가뭐르그르러멛개먿

내가 뭘그렇게

잘못했는데?

','2021-05-25 22:03:32.0','답변완료'),
	 ('movinfo','aaaa11','안녕','ㅁㅁㅁㅁㅁㅁ','','2021-05-25 22:03:32.0','미안하다니깐?
미안하다니깐?
미안하다니깐?
미안하다니깐?
미안하다니깐?
ㅍ
미안하다니깐?
미안하다니깐?ㅇ','2021-05-25 22:03:32.0','답변완료'),
	 ('member','bbbb22','회원문의다이것들아','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ','','2021-05-25 22:03:32.0','',NULL,'미답변'),
	 ('member','aaaa11','ㅎㅇㅎㅇ','ㅁㄴㅇㄴㅇㄻㄹㅇ','','2021-05-25 22:03:32.0','말좀해바
말좀해바
말좀해바
말좀해바
말좀해바

말좀해바
말좀해바
말좀해바
ㅍ말좀해바말좀해바말좀해바말좀해바말좀해바말좀해바말좀해바말좀해바말좀해바말좀해바ㅍ','2021-05-25 22:03:32.0','답변완료'),
	 ('basic','cccc33','ㅁ1ㄴ2ㅇ3ㄹ4','ㄴㅇㅁㅇㄹ','','2021-05-25 22:03:32.0','',NULL,'미답변'),
	 ('suggest','aaaa11','제안합니다','ㅇㄹㅇㄴㄹㅇㄹㄴ','','2021-05-25 22:03:32.0','너랑얘기ㅏㅇ머랴얼미ㅓㄻ;ㅈ댜ㅗㅇㅁ
ㅎㅁ
ㅎ
ㄷㅁㄷㄱㄷㄱ러ㅐㅑ흥ㄴㅁ륲ㅁㄹㅇㅎㅁㄴㅇㄻㄴ
ㅇㄹㄴㅁㅇㄻㄴddafcasdfsafcajfawe
fafㅁㄴㅇ','2021-05-25 22:03:32.0','답변완료');
INSERT INTO unoestellar.personalqna (perscate,persid,perstitle,perscont,persimg,persqtime,persacont,persatime,persstate) VALUES
	 ('movinfo','cccc33','ㅁㄴㅇㄻㄴㅇㄹ','ㄹㅇㄹㅇㅁㄴㅇㄹㄴㅇㄹ','1.png','2021-05-25 22:03:55.0','',NULL,'미답변'),
	 ('basic','cccc33','ㄹㄹㄹㄹㄹㄹㄹㄹㄹ','ㅁㅁㅁ','1.png','2021-05-25 22:04:54.0','',NULL,'미답변'),
	 ('basic','aaaa11','안녕','ㅁㅁㅁㅁㅁㅁ','','2021-05-26 05:24:28.0','',NULL,'미답변'),
	 ('basic','aaaa11','회원문의다이것들아','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ','','2021-05-26 05:24:28.0','',NULL,'미답변'),
	 ('movinfo','bbbb22','ㅎㅇㅎㅇ','ㅁㄴㅇㄴㅇㄻㄹㅇ','','2021-05-26 05:24:28.0','',NULL,'미답변'),
	 ('suggest','cccc33','제안합니다','ㅇㄹㅇㄴㄹㅇㄹㄴ','','2021-05-26 05:24:28.0','',NULL,'미답변'),
	 ('ticket','cccc33','문의있어용','영화예매
영화예매
영화예매
영화예매
영화예매
영화예매
영화예매
',NULL,'2021-05-26 05:43:13.0','',NULL,'미답변'),
	 ('basic','bbbb22','질문받아','질문받아
질문받아

ㅍ질문받아
질문받아
질문받아',NULL,'2021-05-27 06:53:39.0','',NULL,'미답변'),
	 ('basic','cccc33','aaaa','fff',NULL,'2021-05-27 07:09:27.0','',NULL,'미답변'),
	 ('movinfo','aaaa11','asdfsadfsafd','ff',NULL,'2021-05-27 07:09:52.0','',NULL,'미답변');
INSERT INTO unoestellar.personalqna (perscate,persid,perstitle,perscont,persimg,persqtime,persacont,persatime,persstate) VALUES
	 ('lost','bbbb22','저 지갑잃어버렸어요','찾아주세요

안찾아주면

나쁜아이','shotcut1.png','2021-05-27 07:17:08.0','그거 35번째 자리에 있더라구요

좋은하루 되세요!','2021-05-27 07:17:38.0','답변완료'),
	 ('basic','bbbb22','ㄹ','ㅁㅋ',NULL,'2021-06-01 00:49:59.0','',NULL,'미답변'),
	 ('basic','bbbb22','ㄹㅇ','ㅁㄴㅇ','pic1.png','2021-06-01 00:51:35.0','',NULL,'미답변'),
	 ('basic','bbbb22','스컬`~~~~~~~~~~~~~','스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~
스컬`~~~~~~~~~~~~~','shotcut1.png','2021-06-01 01:08:21.0','',NULL,'미답변');
	 

	 

	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 

/*박현준 - 자주묻는질문. 번호, 카테고리(전체, 영화/예매, 가입, 영화관, 기타), 제목, 내용*/
create table basicqna (
	bqindex int auto_increment primary key,
	bqcate varchar(100),
	bqtitle varchar(100),
	bqcont varchar(3000)
);

INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ'),
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ');
INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ'),
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ');
INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ'),
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ');
INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ'),
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ');
INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ'),
	 ('영화/예매','영화/예매 기본질문 1','ㅁㅁㅁㅁㅁㅁ'),
	 ('가입','가입 기본질문 1','ㅁㄴㅇㄻㄴㅇㄹㄴㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 1','ㅁㄴㅇㄴㅇㄻㄹㅇ'),
	 ('기타','기타 기본질문 1','ㄴㅇㅁㅇㄹ'),
	 ('영화관','영화관 기본질문 2','ㅇㄹㅇㄴㄹㅇㄹㄴ');
INSERT INTO unoestellar.basicqna (bqcate,bqtitle,bqcont) VALUES
	 ('영화/예매','ㅇㅇㅇㅇㅇ','ㅇㅇㅇㅇㅇㅇ'),
	 ('영화/예매','로그인이 안돼요','아이디 비밀번호 찾기를 이용하세요   user/http://localhost:8080/member/login/idFind');
