<!-- 리뷰 테이블-->
create table review(
	cnt int auto_increment primary key,
	cate varchar(100),
	userid varchar(100),
	postcontent varchar(2000),
	posttime datetime,
	gpa int
);

<!--리뷰 데이타-->
insert into review (cate, userid, postcontent, posttime, gpa) values 
(1, 'aaaa11', '관람평1', '2021-04-05 11:22:11', 4),
(1, 'bbbb22', '관람평2', '2021-05-05 12:12:11', 5),
(1, 'cccc33', '관람평3', '2021-04-21 11:00:12', 3),
(1, 'eeee55', '관람평4', '2021-04-21 12:22:11', 3),

(2, 'aaaa11', '관람평1', '2020-11-22 11:00:00', 3),
(2, 'bbbb22', '관람평2', '2021-03-11 11:00:00', 1),
(2, 'dddd44', '관람평3', '2021-03-12 11:00:00', 2),
(2, 'eeee55', '관람평4', '2021-03-14 11:00:00', 4),

(3, 'aaaa11', '관람평1', '2020-11-22 11:00:00', 2),
(3, 'bbbb22', '관람평2', '2021-04-11 11:00:00', 5),
(3, 'dddd44', '관람평3', '2021-05-12 11:00:00', 1),
(3, 'eeee55', '관람평4', '2021-03-14 11:00:00', 5),

(4, 'aaaa11', '관람평1', '2021-01-22 11:00:00', 3),
(4, 'bbbb22', '관람평2', '2021-02-11 11:12:00', 1),
(4, 'dddd44', '관람평3', '2021-03-12 11:00:00', 2),
(4, 'eeee55', '관람평4', '2021-04-14 11:22:00', 2),

(6, 'aaaa11', '관람평1', '2020-12-22 11:00:00', 3),
(6, 'bbbb22', '관람평2', '2021-02-28 11:00:00', 3),
(6, 'dddd44', '관람평3', '2021-03-21 11:00:00', 3),
(6, 'eeee55', '관람평4', '2021-04-21 11:00:00', 3);

<!-- 좋아요-->
create table userlikes(
g_index int auto_increment primary key,
userid varchar(200),
m_index int
);	

